import React from 'react';

export const protocol = (type: string): JSX.Element => (
  <div style={{ padding: '12px 26px' }}>
    <p style={{ width: '100%' }}>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;尊敬的用户，欢迎您使用e精灵
      {' '}
      {type}
      ！ 特别提示： 在使用e精灵
      {' '}
      {type}
      之前，您应当认真阅读并遵守《e精灵 SaaS
      {' '}
      {type}
      服务协议》（以下简称“本协议”），请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。如您对协议有任何疑问的，应向e精灵
      {' '}
      {type}
      系统客服咨询。 当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与e精灵
      {' '}
      {type}
      达成协议。您承诺接受并遵守本协议的约定， 届时您不应以未阅读本协议的内容或者未获得e精灵
      {' '}
      {type}
      对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
    </p>
    <p>
      一、签约主体
    </p>
    <p>
      1.1、本许可协议的缔约方为e精灵SaaS
      {' '}
      {type}
      和用户（“您”），本许可协议具有合同效力。
    </p>
    <p>
      二、软件许可方式
    </p>
    <p>
      2.1、用户需按照e精灵SaaS
      {' '}
      {type}
      的注册流程合法注册并取得账号，即可合法使用e精灵SaaS
      {' '}
      {type}
      。对于用户通过其他手段登录、使用所造成的后果，e精灵 SaaS
      {' '}
      {type}
      将不承担任何责任。
    </p>
    <p>
      2.2、e精灵 SaaS
      {' '}
      {type}
      仅根据用户登录名和密码来确认使用e精灵 SaaS
      {' '}
      {type}
      应用的用户身份。用户应妥善保管用户登录名及密码，并对该登录名及密码的使用或遗失、被盗等自行承担责任。
    </p>
    <p>
      三、用户的权利和义务
    </p>
    <p>
      3.1、用户保证其使用e精灵SaaS
      {' '}
      {type}
      应用的各项行为均符合国家法律法规的规定，其通过应用所从事的一切活动都是合法的、真实的，不侵害e精灵SaaS
      {' '}
      {type}
      和任何第三方的合法权益，包括但不限于：
    </p>
    <p>
      3.1.1、禁止出售、转售或复制e精灵SaaS
      {' '}
      {type}
      授予的使用权限；
    </p>
    <p>
      3.1.2、禁止复制和模仿e精灵SaaS
      {' '}
      {type}
      的设计理念、界面、功能和图表；
    </p>
    <p>
      3.1.3、禁止未经e精灵SaaS
      {' '}
      {type}
      许可基于e精灵SaaS
      {' '}
      {type}
      应用或其内容进行修改或制造派生其他产品；
    </p>
    <p>
      3.2、用户不得对e精灵SaaS
      {' '}
      {type}
      应用和/或e精灵SaaS
      {' '}
      {type}
      应用任何部分（软件产品、页面标识、服务品牌、资讯、信息）进行复制、翻译、修改、适应、增强、反编译、反汇编、反向工程、分解拆卸、出售、转租或作任何商业目的的使用。用户同意约束其有必要使用e精灵SaaS
      {' '}
      {type}
      应用的员工、代理、咨询者或顾问遵守前述之义务，并就其违反前述规定的行为对e精灵SaaS
      {' '}
      {type}
      负责就如同用户自身违反一样。
    </p>
    <p>
      3.3、e精灵SaaS
      {' '}
      {type}
      提请注意：在使用应用之前，充分了解、掌握应用的各项功能，审慎阅读应用的操作说明和/或使用说明，严格按照应用的使用说明和/或操作说明使用应用。用户承诺通过e精灵SaaS
      {' '}
      {type}
      应用进行的活动所引发的一切法律后果，由用户承担全部责任。如因用户使用e精灵SaaS
      {' '}
      {type}
      应用的行为，导致e精灵SaaS
      {' '}
      {type}
      或任何第三方为此承担了相关的责任，则用户需全额赔偿e精灵SaaSS
      {' '}
      {type}
      或任何第三方的相关支出及损失，包括合理的律师费用。
    </p>
    <p>
      3.4、用户同意在使用e精灵SaaS
      {' '}
      {type}
      应用的同时，接受e精灵SaaS
      {' '}
      {type}
      提供的各类信息服务。
    </p>
    <p>
      3.4、用户理解并同意e精灵SaaS
      {' '}
      {type}
      应用因现有技术限制，可能存在瑕疵，因使用e精灵SaaS
      {' '}
      {type}
      应用所致的任何损害。如因网络问题或产品瑕疵导致e精灵SaaS
      {' '}
      {type}
      应用无法按指定的时间正常使用的，则用户了解并同意e精灵SaaS
      {' '}
      {type}
      或其它责任人所需承担的唯一责任就是在e精灵SaaS
      {' '}
      {type}
      可控范围内最短时间内解决问题，让用户尽快恢复正常。
    </p>
    <p>
      3.5、用户同意将e精灵SaaS
      {' '}
      {type}
      应用用于其功能所指向的合法的目的和用途，并不进行任何竞争性、破坏性或非法的使用。
    </p>
    <p>
      3.7、用户理解并同意e精灵SaaS
      {' '}
      {type}
      应用的唯一责任人为e精灵SaaS
      {' '}
      {type}
      。
    </p>
    <p>
      四、e精灵SaaS
      {' '}
      {type}
      的权利和义务
    </p>
    <p>
      4.1、e精灵SaaS
      {' '}
      {type}
      保证其有合法权利向用户提供e精灵SaaS
      {' '}
      {type}
      应用的使用许可，并保证与e精灵SaaS
      {' '}
      {type}
      应用运行相关的软件产品版权的合法性。e精灵 SaaS
      {' '}
      {type}
      承诺其向用户提供e精灵SaaS
      {' '}
      {type}
      应用使用许可之行为未对任何第三方合法权益，包括但不限于第三方知识产权构成侵害。如因其行为导致用户遭受任何第三方提起的法律诉讼或行政程序（合称“侵权指控”），声称用户侵犯了其合法所有权或知识产权，e精灵 SaaS
      {' '}
      {type}
      同意赔偿用户就此所承担的所有费用，包括但不限于上述侵权指控中所产生的一切诉讼费用、合理的律师费用、和解金额或终审判决中规定的赔偿金额。
    </p>
    <p>
      4.2、e精灵 SaaS
      {' '}
      {type}
      保证应用的稳定可靠，负责应用的系统调试、开通、优化、升级和扩容工作，并保证前述工作不影响用户的正常使用。如因服务商应用质量问题导致用户损失的，e精灵 SaaS
      {' '}
      {type}
      应承担全额的赔偿责任，因常规系统更新、升级、维护而造成的使用中断除外。。
    </p>
    <p>
      4.3、e精灵 SaaS
      {' '}
      {type}
      负责及时对应用进行更新、维护和管理，并向用户提供免费的技术支持服务。（周一至周五：9：00-21：00；周六、日：10：00-18：00，法定节假日另行通知）
    </p>
    <p>
      4.3、如因e精灵SaaS
      {' '}
      {type}
      的原因（包括但不限于因e精灵SaaS
      {' '}
      {type}
      违反与淘宝、天猫、京东等销售平台达成的有关协议而导致终止提供相关服务的），导致用户对于e精灵SaaS
      {' '}
      {type}
      应用的使用许可需提前终止的，e精灵 SaaS
      {' '}
      {type}
      应对用户履行相应的数据下载服务。如因此给用户造成损失的，e精灵 SaaS
      {' '}
      {type}
      应承担全额的赔偿责任，
    </p>
    <p>
      五、用户数据的保存、销毁与下载
    </p>
    <p>
      5.1、e精灵 SaaS
      {' '}
      {type}
      应在其网络系统内建立合理的安全体系，包括身份识别体系、内部安全防范体系，以使用户数据完整，并且保密。严禁e精灵SaaS
      {' '}
      {type}
      向任何人出售、出借或无偿传播用户数据，除非事先得到用户的许可。本协议项下用户数据尤其指用户基于e精灵SaaS
      {' '}
      {type}
      应用功能的使用而自行导入的与e精灵SaaSS
      {' '}
      {type}
      应用功能相关的用户业务数据。
    </p>
    <p>
      5.2、为服务用户的目的，e精灵 SaaS
      {' '}
      {type}
      可能通过使用用户数据，向用户提供服务，包括但不限于向用户发出产品和服务信息。
    </p>
    <p>
      5.3、用户数据将在下述情况下部分或全部被披露：
    </p>
    <p>
      5.3.1、经用户同意，向第三方披露；
    </p>
    <p>
      5.3.2、根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构 披露；
    </p>
    <p>
      5.3.3、如果用户出现违反中国有关法律法规的情况，需要向第三方披露；
    </p>
    <p>
      5.3.3、为提供用户所要求的软件或服务，而必须和第三方分享用户数据。
    </p>
    <p>
      5.4、除e精灵SaaS
      {' '}
      {type}
      和用户另行约定外，自用户软件许可期满或因任何原因导致本协议提前终止（以下简称“许可终止”）之日起最少90日内，服务商应继续免费存储用户数据，逾期e精灵SaaS
      {' '}
      {type}
      将不再存储用户数据，届时用户需自行承担其数据被销毁后引发的一切后果。
    </p>
    <p>
      5.5、除e精灵SaaS
      {' '}
      {type}
      和用户另行约定外，在以下期限内e精灵SaaS
      {' '}
      {type}
      承诺向用户提供免费数据下载服务，用户可自行至e精灵SaaS
      {' '}
      {type}
      指定的服务器下载其数据：
    </p>
    <p>
      5.5.1、用户软件许可期限内；
    </p>
    <p>
      5.5.2、自用户软件许可期满或因任何原因导致本协议提前终止之日起30日内。
    </p>
    <p>
      六、终止
    </p>
    <p>
      6.1、出现下列情况之一的，e精灵 SaaS
      {' '}
      {type}
      有权在提前三个工作日通知用户的情况下，终止用户使用e精灵SaaS
      {' '}
      {type}
      应用的权利，而无需承担任何责任：
    </p>
    <p>
      6.1.1、用户在应用软件许可期限届满后未继续付费购买后续期间的软件许可的；
    </p>
    <p>
      6.1.2、用户违反本协议有关保证、同意、承诺条款的约定，且自e精灵SaaS
      {' '}
      {type}
      通知其纠正后仍未纠正的；
    </p>
    <p>
      七、协议修改
    </p>
    <p>
      7.1、如本许可协议的任何内容发生变动，e精灵 SaaS
      {' '}
      {type}
      应通过适当方式向用户提示修改内容。
    </p>
    <p>
      7.2、如用户不同意e精灵SaaS
      {' '}
      {type}
      对本许可协议相关条款所做的修改，用户有权停止使用e精灵SaaS
      {' '}
      {type}
      应用。此等情况下，e精灵 SaaS
      {' '}
      {type}
      应向用户退回剩余许可费用（如有），并向用户提供其业务数据的下载服务。如用户继续使用e精灵SaaS
      {' '}
      {type}
      应用，则视为用户接受e精灵SaaS
      {' '}
      {type}
      对本许可协议相关条款所做的修改。
    </p>
    <p>
      八、不可抗力
    </p>
    <p>
      8.1、如果由于黑客攻击或政府管制或网络通讯瘫痪等对其发生和后果不能预见的事件，e精灵 SaaS
      {' '}
      {type}
      和用户均确认此属不可抗力；在不可抗力下，用户同意e精灵SaaS
      {' '}
      {type}
      及第三方无须对合同的延期履行、不能履行承担任何责任。
    </p>
    <p>
      九、法律及争议解决
    </p>
    <p>
      9.1、本协议适用中华人民共和国法律。
    </p>
    <p>
      9.2、因双方就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，任何一方均有权向e精灵所在辖区人民法院起诉。
    </p>
    <p>
      十、其他
    </p>
    <p>
      10.1、本协议构成用户和e精灵SaaS
      {' '}
      {type}
      间就使用e精灵SaaS
      {' '}
      {type}
      应用的完整的协议，并取代双方就有关本协议所载任何事项于先前以口头及书面达成的共识。
    </p>
    <p>
      10.2、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部分则仍具有法律效力。
    </p>
    <p>
      10.3、e精灵 SaaS
      {' '}
      {type}
      可根据其自身运营状况，在提前三个工作日通知用户的前提下，将其在本协议项下的权利义务全部转让给第三方，而无需获得用户的事先同意。e精灵 SaaS
      {' '}
      {type}
      之受让人受本协议约束，e精灵 SaaS
      {' '}
      {type}
      与其受让人对本协议的履行承担连带责任。
    </p>
  </div>
);
